bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/XMEGA/ATXMEGA16A4U.xml
                <register caption="Interrupt Flag Register" name="INTFLAGS" offset="0x0C" size="1">
                    <bitfield caption="Port Interrupt 1 Flag" mask="0x02" name="INT1IF"/>
                    <bitfield caption="Port Interrupt 0 Flag" mask="0x01" name="INT0IF"/>
                </register>
                <register caption="I/O Port Pin Remap Register" name="REMAP" offset="0x0E" size="1">
                    <bitfield caption="SPI" mask="0x20" name="SPI"/>
                    <bitfield caption="USART0" mask="0x10" name="USART0"/>
                    <bitfield caption="Timer/Counter 0 Output Compare D" mask="0x08" name="TC0D"/>
                    <bitfield caption="Timer/Counter 0 Output Compare C" mask="0x04" name="TC0C"/>
                    <bitfield caption="Timer/Counter 0 Output Compare B" mask="0x02" name="TC0B"/>
                    <bitfield caption="Timer/Counter 0 Output Compare A" mask="0x01" name="TC0A"/>
                </register>
                <register caption="Pin 0 Control Register" name="PIN0CTRL" offset="0x10" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 1 Control Register" name="PIN1CTRL" offset="0x11" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 2 Control Register" name="PIN2CTRL" offset="0x12" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 3 Control Register" name="PIN3CTRL" offset="0x13" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 4 Control Register" name="PIN4CTRL" offset="0x14" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 5 Control Register" name="PIN5CTRL" offset="0x15" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 6 Control Register" name="PIN6CTRL" offset="0x16" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
                <register caption="Pin 7 Control Register" name="PIN7CTRL" offset="0x17" size="1">
                    <bitfield caption="Slew Rate Enable" mask="0x80" name="SRLEN"/>
                    <bitfield caption="Inverted I/O Enable" mask="0x40" name="INVEN"/>
                    <bitfield caption="Output/Pull Configuration" mask="0x38" name="OPC" values="PORT_OPC"/>
                    <bitfield caption="Input/Sense Configuration" mask="0x07" name="ISC" values="PORT_ISC"/>
                </register>
            </register-group>
            <value-group caption="Port Interrupt 0 Level" name="PORT_INT0LVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Port Interrupt 1 Level" name="PORT_INT1LVL">
                <value caption="Interrupt Disabled" name="OFF" value="0x00"/>
                <value caption="Low Level" name="LO" value="0x01"/>
                <value caption="Medium Level" name="MED" value="0x02"/>
                <value caption="High Level" name="HI" value="0x03"/>
            </value-group>
            <value-group caption="Output/Pull Configuration" name="PORT_OPC">
                <value caption="Totempole" name="TOTEM" value="0x00"/>
                <value caption="Totempole w/ Bus keeper on Input and Output" name="BUSKEEPER" value="0x01"/>
                <value caption="Totempole w/ Pull-down on Input" name="PULLDOWN" value="0x02"/>
                <value caption="Totempole w/ Pull-up on Input" name="PULLUP" value="0x03"/>
                <value caption="Wired OR" name="WIREDOR" value="0x04"/>
                <value caption="Wired AND" name="WIREDAND" value="0x05"/>
                <value caption="Wired OR w/ Pull-down" name="WIREDORPULL" value="0x06"/>
                <value caption="Wired AND w/ Pull-up" name="WIREDANDPULL" value="0x07"/>
            </value-group>
            <value-group caption="Input/Sense Configuration" name="PORT_ISC">
                <value caption="Sense Both Edges" name="BOTHEDGES" value="0x00"/>
                <value caption="Sense Rising Edge" name="RISING" value="0x01"/>
                <value caption="Sense Falling Edge" name="FALLING" value="0x02"/>
                <value caption="Sense Level (Transparent For Events)" name="LEVEL" value="0x03"/>
                <value caption="Disable Digital Input Buffer" name="INPUT_DISABLE" value="0x07"/>
            </value-group>
            <interrupt-group name="PORT">
                <interrupt index="0" name="INT0" caption="External Interrupt 0"/>
                <interrupt index="1" name="INT1" caption="External Interrupt 1"/>
            </interrupt-group>
        </module>
        <module name="TC" id="I6090" version="XMEGAAU" caption="16-bit Timer/Counter With PWM">
            <register-group caption="16-bit Timer/Counter 0" name="TC0" size="64">
                <register caption="Control Register A" name="CTRLA" offset="0x00" size="1">
                    <bitfield caption="Clock Selection" mask="0x0F" name="CLKSEL" values="TC_CLKSEL"/>
                </register>
                <register caption="Control Register B" name="CTRLB" offset="0x01" size="1">
                    <bitfield caption="Compare or Capture D Enable" mask="0x80" name="CCDEN"/>
                    <bitfield caption="Compare or Capture C Enable" mask="0x40" name="CCCEN"/>
                    <bitfield caption="Compare or Capture B Enable" mask="0x20" name="CCBEN"/>
                    <bitfield caption="Compare or Capture A Enable" mask="0x10" name="CCAEN"/>
                    <bitfield caption="Waveform generation mode" mask="0x07" name="WGMODE" values="TC_WGMODE"/>
                </register>
